zenes/esp32s3-TAS/examples/tas/tas.ino
void refreshLine() {
  // Move cursor to beginning of line (using \r)
  Serial.print("\r> ");
  // Print current inputString
  Serial.print(inputString);
  // Clear any leftover characters from previous longer string
  Serial.print("\033[K"); 
  // Move cursor back to current cursor_pos
  if (cursor_pos < inputString.length()) {
    Serial.printf("\033[%dD", (int)(inputString.length() - cursor_pos));
  }
}

void installHooks() {
  esp_netif_t* eth_netif = ETH.netif();
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  esp_netif_t* ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
#else
  esp_netif_t* ap_netif = WiFi.AP.netif();
#endif

  if (eth_netif && orig_eth_input == NULL) {
    struct netif* lwip_eth = (struct netif*)esp_netif_get_netif_impl(eth_netif);
    if (lwip_eth) {
      orig_eth_input = lwip_eth->input;
      orig_eth_linkoutput = lwip_eth->linkoutput;
      lwip_eth->input = eth_input_hook;
      lwip_eth->linkoutput = eth_linkoutput_hook;
      logMsg(LOG_INFO, "ETH Hooks installed (Handle: %p, netif: %p)", eth_netif, lwip_eth);
    }
  }

  if (ap_netif && orig_ap_input == NULL) {
    struct netif* lwip_ap = (struct netif*)esp_netif_get_netif_impl(ap_netif);
    if (lwip_ap) {
      orig_ap_input = lwip_ap->input;
      orig_ap_linkoutput = lwip_ap->linkoutput;
      lwip_ap->input = ap_input_hook;
      lwip_ap->linkoutput = ap_linkoutput_hook;
      logMsg(LOG_INFO, "AP Hooks installed (Handle: %p, netif: %p)", ap_netif, lwip_ap);
    }
  }
}

// Command List for Autocomplete
const char* shell_commands[] = {
  "help", "status", "dmesg", "loglevel", "monitor", "restart", "set_ssid", "set_pw", "stats", "traffic", "ping", "ifconfig", "arp", "dhcp", "iperf", "udp_iperf", "toe_iperf"
};
const int shell_cmd_count = sizeof(shell_commands) / sizeof(shell_commands[0]);

// Shell History
#define MAX_HISTORY 10
static String shell_history[MAX_HISTORY];
static int history_count = 0;
static int history_index = -1;

// Autocomplete Cycling
static int tab_match_index = -1;
static String tab_prefix = "";

// ANSI Sequence Parser State
static enum { ANSI_NONE, ANSI_ESC, ANSI_BRACKET } ansi_state = ANSI_NONE;

TFT_eSPI tft = TFT_eSPI(); // Invoke custom library
#define ENABLE_LCD


#define ENABLE_GRADIENT_BG // 그라데이션 배경 활성화 (기본 OFF)
static bool lcd_initialized = false;
static bool lcd_detected = false;

/* Touch Instance */
#ifdef LCD_TYPE_ILI9341
XPT2046_Touchscreen tp(TOUCH_CS, TOUCH_IRQ);
#elif defined(TOUCH_SDA) && defined(TOUCH_SCL)
TAMC_GT911 tp = TAMC_GT911(TOUCH_SDA, TOUCH_SCL, TOUCH_INT, TOUCH_RST, TFT_WIDTH, TFT_HEIGHT);
#endif
static lv_obj_t * touch_cursor;
static lv_obj_t * touch_label;
static lv_obj_t * touch_line_h;
static lv_obj_t * touch_line_v;

/* LVGL Touchpad Read Callback */
void my_touchpad_read(lv_indev_drv_t * indev_drv, lv_indev_data_t * data) {
#if defined(LCD_TYPE_ILI9341) || (defined(TOUCH_SDA) && defined(TOUCH_SCL))
    bool touched = false;
    int x = 0, y = 0;

    #ifdef LCD_TYPE_ILI9341
    if (tp.touched()) {
        TS_Point p = tp.getPoint();
        x = map(p.x, 200, 3700, 0, TFT_WIDTH);
        y = map(p.y, 240, 3800, 0, TFT_HEIGHT);
        touched = true;
    }
    #elif defined(TOUCH_SDA) && defined(TOUCH_SCL)
    tp.read();
    if (tp.isTouched) {
        // Calibration mapping: 
        // X: 0 ~ 300 -> 0 ~ 319
        // Y: 85 ~ 315 -> 0 ~ 239
        int raw_x = tp.points[0].x;
        int raw_y = tp.points[0].y;
        x = map(raw_x, 0, 300, 0, 319);
        y = map(raw_y, 85, 315, 0, 239);
        touched = true;
    }
    #endif

    if (touched) {
        data->state = LV_INDEV_STATE_PR;
        data->point.x = x;
        data->point.y = y;
        
        // Constrain to screen bounds
        if (data->point.x < 0) data->point.x = 0;
        if (data->point.x >= TFT_WIDTH) data->point.x = TFT_WIDTH - 1;
        if (data->point.y < 0) data->point.y = 0;
        if (data->point.y >= TFT_HEIGHT) data->point.y = TFT_HEIGHT - 1;

        if (touch_cursor) {
            lv_obj_set_pos(touch_cursor, data->point.x - 5, data->point.y - 5);
            lv_obj_clear_flag(touch_cursor, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_pos(touch_line_h, 0, data->point.y);
            lv_obj_clear_flag(touch_line_h, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_pos(touch_line_v, data->point.x, 0);
            lv_obj_clear_flag(touch_line_v, LV_OBJ_FLAG_HIDDEN);
            lv_label_set_text_fmt(touch_label, "X:%d Y:%d", data->point.x, data->point.y);
            lv_obj_set_pos(touch_label, data->point.x + 15, data->point.y + 15);
            lv_obj_clear_flag(touch_label, LV_OBJ_FLAG_HIDDEN);
        }
    } else {
        data->state = LV_INDEV_STATE_REL;
        if (touch_cursor) {
            lv_obj_add_flag(touch_cursor, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(touch_line_h, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(touch_line_v, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(touch_label, LV_OBJ_FLAG_HIDDEN);
        }
    }
#else
    data->state = LV_INDEV_STATE_REL;
#endif
}

/* LVGL Double Buffers (Internal SRAM with DMA) */
static lv_disp_draw_buf_t draw_buf;
static lv_color_t *buf1 = NULL; 
static lv_color_t *buf2 = NULL; 

/* UI Objects */
static lv_obj_t *ui_label_eth;
static lv_obj_t *ui_label_ap;
static lv_obj_t *ui_label_clients;
static lv_obj_t *ui_label_fps;
#ifdef ENABLE_TE_SYNC
static lv_obj_t *ui_label_te;
#endif
static lv_obj_t *ui_debug_panel;
static lv_obj_t *ui_label_spi;
static lv_obj_t *ui_label_tgt_fps;
static lv_obj_t *ui_test_rect;
static uint32_t frame_cnt = 0;
static uint32_t fps_val = 0;

/* Timer callback to force Full Screen UI changes (Gradient/Color shift logic) */
#ifdef ENABLE_GRADIENT_BG
void move_test_rect_cb(lv_timer_t * t) {
  static uint8_t c = 0;
  c += 2; // Slower, smoother change
  lv_obj_t *scr = lv_scr_act();
  if (scr) {
    lv_obj_set_style_bg_color(scr, lv_color_make(c, 100, 200), 0);
    lv_obj_set_style_bg_grad_color(scr, lv_color_make(200 - c, 50, 150), 0);
    lv_obj_set_style_bg_grad_dir(scr, LV_GRAD_DIR_VER, 0);
  }
}
#endif

#ifdef ENABLE_TE_SYNC
#define TE_PIN 21
static SemaphoreHandle_t te_semaphore = NULL;

