zenes/esp32s3-TAS/examples/tas/tas.ino
// TE 핀 주파수 측정용 변수 (명령어 사이사이 안전한 읽기를 위해 64비트 타이머 사용)
volatile int64_t last_te_time_us = 0;
volatile int64_t te_delta_us = 0;

void IRAM_ATTR te_isr_handler() {
    int64_t now_us = esp_timer_get_time();
    if (last_te_time_us > 0) {
        te_delta_us = now_us - last_te_time_us;
    }
    last_te_time_us = now_us;

    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if (te_semaphore != NULL) {
        xSemaphoreGiveFromISR(te_semaphore, &xHigherPriorityTaskWoken);
        if (xHigherPriorityTaskWoken) {
            portYIELD_FROM_ISR();
        }
    }
}
#endif

/* Display flushing callback (Asynchronous DMA) */
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p) {
  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);

  static bool transfer_open = false;

  // 1. Wait for PREVIOUS DMA transfer to finish, then close the SPI transaction
  if (transfer_open) {
    if (tft.dmaBusy()) {
      //delay(1); or yield();
      tft.dmaWait();
    }
    tft.endWrite(); // Resets CS pin HIGH (SPI Sync reset)
  }

  // 2. Start new transfer session (CS pin LOW)
  tft.startWrite(); 
  tft.setAddrWindow(area->x1, area->y1, w, h);

#ifdef ENABLE_TE_SYNC
  // 3. V-Sync(TE) 동기화 복구 (첫 번째 조각 전송 전에만 스캐너 대기)
  static bool wait_for_te = true;
  if (wait_for_te && te_semaphore != NULL) {
      xSemaphoreTake(te_semaphore, pdMS_TO_TICKS(100)); // TE 신호 한 사이클 대기
  }
  wait_for_te = lv_disp_flush_is_last(disp); // 마지막 조각을 보낼 때 다음 프레임을 위해 대기 락 설정
#endif

  tft.pushPixelsDMA((uint16_t *)color_p, w * h);
  
  // CRITICAL: We DO NOT call tft.endWrite() here!
  // Instead, we mark it open so the NEXT flush closes it to prevent SPI lock-up.
  transfer_open = true;
  
  frame_cnt++;
  lv_disp_flush_ready(disp); // Tell LVGL we are ready for the NEXT frame buffer
}

volatile uint32_t last_render_time_ms = 0;

// LVGL 모니터링 콜백 (렌더링 소요 시간 직관적 측정용)
void my_monitor_cb(lv_disp_drv_t * disp_drv, uint32_t time, uint32_t px) {
  // 화면 갱신 시 소요된 렌더링 시간을 저장
  if (time > 0) {
    last_render_time_ms = time;
  }
}

// Network state
// ============================================================================
// Network Configuration (Static IP)
// Set USE_STATIC_IP to true if you want to use a static IP address.
// This is useful if DHCP is not available or slow (Example: Corporate Network).
// ============================================================================
#define USE_STATIC_IP true // Set to true to enable Static IP

#if USE_STATIC_IP
// Please change these values to match your network environment
IPAddress local_ip(192, 168, 0, 50);
IPAddress gateway(192, 168, 0, 100); // Set gateway to Device A (Direct Connect)
IPAddress subnet(255, 255, 255, 0);
IPAddress dns1(8, 8, 8, 8);
IPAddress dns2(8, 8, 4, 4);
#endif

// Network state
static bool eth_connected = false;
static bool ap_started = false;

/**
 * @brief Dynamic LCD hardware detection
 * @return true if LCD is detected, false otherwise
 */
bool detectLCD() {
  Serial.print("Probing LCD hardware... ");
  
  // Use SPI2 (FSPI) to avoid conflict with Ethernet (SPI3) on some boards
  static SPIClass* spi_p = nullptr;
  if (!spi_p) spi_p = new SPIClass(FSPI); 
  spi_p->begin(TFT_SCLK, TFT_MISO, TFT_MOSI, TFT_CS);
  
  pinMode(TFT_MISO, INPUT_PULLUP);
  pinMode(TFT_CS, OUTPUT);
  pinMode(TFT_DC, OUTPUT);
  pinMode(TFT_RST, OUTPUT);

  // Hardware Reset
  digitalWrite(TFT_RST, LOW);
  delay(100); 
  digitalWrite(TFT_RST, HIGH);
  delay(200); 
  
  digitalWrite(TFT_CS, LOW);
  delay(5); 
  
  spi_p->beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
  
  // Multiple ID probe (ST7789 requires 1-byte dummy before parameter)
  auto readID = [&](uint8_t cmd) {
    digitalWrite(LCD_DC_PIN, LOW); spi_p->transfer(cmd);
    digitalWrite(LCD_DC_PIN, HIGH);
    spi_p->transfer(0x00); // Dummy Byte
    return spi_p->transfer(0x00); // Real ID
  };

  uint8_t id1 = readID(0xDA);
  uint8_t id2 = readID(0xDB);
  uint8_t id3 = readID(0xDC);
  
  spi_p->endTransaction();
  digitalWrite(LCD_CS_PIN, HIGH);
  
  bool detected = (id1 != 0x00 && id1 != 0xFF) || (id2 != 0x00 && id2 != 0xFF) || (id3 != 0x00 && id3 != 0xFF);

  if (detected) {
    Serial.printf("Done. LCD Detected (ID:%02X%02X%02X)\n", id1, id2, id3);
  } else {
    Serial.println("Failed. LCD not found.");
  }
  
  return detected;
}

/**
 * @brief Initialize LVGL UI widgets
 */
void initLVGLUI() {
  lv_obj_t *scr = lv_scr_act();
  if (!scr) return;

  lv_obj_set_style_bg_color(scr, lv_color_black(), 0);

#ifdef ENABLE_GRADIENT_BG
  lv_obj_set_style_bg_color(scr, lv_palette_main(LV_PALETTE_BLUE), 0);
  lv_obj_set_style_bg_grad_color(scr, lv_palette_main(LV_PALETTE_PURPLE), 0);
  lv_obj_set_style_bg_grad_dir(scr, LV_GRAD_DIR_VER, 0);
#endif
  
  // 화면 잘림 현상을 확인하기 위한 전체 테두리 (디버깅용)
  lv_obj_set_style_border_color(scr, lv_color_make(255, 255, 255), 0);
  lv_obj_set_style_border_width(scr, 2, 0);
  lv_obj_set_style_pad_all(scr, 0, 0); // 패딩 제거로 모서리까지 꽉 차게 변경

  /* Title */
  lv_obj_t *title = lv_label_create(scr);
  lv_label_set_text(title, "TAS Bridge");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(title, lv_palette_main(LV_PALETTE_YELLOW), 0);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);
  lv_obj_add_flag(title, LV_OBJ_FLAG_HIDDEN); // 숨김

  /* Debug Panel */
  ui_debug_panel = lv_obj_create(scr);
  lv_obj_set_size(ui_debug_panel, 175, LV_SIZE_CONTENT);
  lv_obj_align(ui_debug_panel, LV_ALIGN_RIGHT_MID, -10, 0); // 화면 우측 중앙(y=120)으로 정렬
  // 디버그 패널 자체는 살리고 내부 글씨들만 골라서 숨김
  lv_obj_set_style_bg_color(ui_debug_panel, lv_color_make(20, 20, 20), 0); // 어두운 회색/검정
  lv_obj_set_style_bg_opa(ui_debug_panel, LV_OPA_90, 0); // 약간의 투명도
  lv_obj_set_style_border_width(ui_debug_panel, 1, 0);
  lv_obj_set_style_border_color(ui_debug_panel, lv_color_make(70, 70, 70), 0);
  lv_obj_set_style_pad_all(ui_debug_panel, 8, 0);
  
  // 패널 내부를 Flex(세로 정렬) 레이아웃으로 설정
  lv_obj_set_layout(ui_debug_panel, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(ui_debug_panel, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_flex_align(ui_debug_panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START);
  lv_obj_set_style_pad_row(ui_debug_panel, 4, 0); // 줄 간격

  /* Title of Debug Panel */
  lv_obj_t *debug_title = lv_label_create(ui_debug_panel);
  lv_label_set_text(debug_title, "DEBUG INFO");
  lv_obj_set_style_text_font(debug_title, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(debug_title, lv_palette_main(LV_PALETTE_LIGHT_BLUE), 0);
  lv_obj_add_flag(debug_title, LV_OBJ_FLAG_HIDDEN); // 숨김

  /* FPS Label */
  ui_label_fps = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_fps, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(ui_label_fps, lv_color_white(), 0);
  lv_label_set_text(ui_label_fps, "FPS: 0");

  /* Target FPS Label */
  ui_label_tgt_fps = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_tgt_fps, &lv_font_montserrat_14, 0); 
  lv_obj_set_style_text_color(ui_label_tgt_fps, lv_palette_main(LV_PALETTE_ORANGE), 0);
  lv_obj_add_flag(ui_label_tgt_fps, LV_OBJ_FLAG_HIDDEN); // 숨김
#ifdef LV_DISP_DEF_REFR_PERIOD
  lv_label_set_text_fmt(ui_label_tgt_fps, "TGT: %d FPS", 1000 / LV_DISP_DEF_REFR_PERIOD);
#else
  lv_label_set_text(ui_label_tgt_fps, "TGT: 33 FPS"); // LVGL 기본 모니터 주기(30ms)
#endif

  /* SPI Clock Label */
  ui_label_spi = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_spi, &lv_font_montserrat_14, 0); 
  lv_obj_set_style_text_color(ui_label_spi, lv_palette_main(LV_PALETTE_LIGHT_GREEN), 0);
  lv_obj_add_flag(ui_label_spi, LV_OBJ_FLAG_HIDDEN); // 숨김
#ifdef SPI_FREQUENCY
  lv_label_set_text_fmt(ui_label_spi, "SPI: %d MHz", SPI_FREQUENCY / 1000000);
#else
  lv_label_set_text(ui_label_spi, "SPI: 80 MHz");
#endif

#ifdef ENABLE_TE_SYNC
  /* TE Timing Label */
  ui_label_te = lv_label_create(ui_debug_panel);
  lv_obj_set_style_text_font(ui_label_te, &lv_font_montserrat_14, 0); 
  lv_obj_set_style_text_color(ui_label_te, lv_palette_main(LV_PALETTE_YELLOW), 0);
  // lv_obj_add_flag(ui_label_te, LV_OBJ_FLAG_HIDDEN); // 다시 표시되도록 주석 처리
  lv_label_set_text(ui_label_te, "TE: --");
#endif

  /* Color Test Boxes (Bottom) */
  static lv_color_t test_colors[] = {LV_COLOR_MAKE(255,0,0), LV_COLOR_MAKE(0,255,0), LV_COLOR_MAKE(0,0,255), LV_COLOR_MAKE(255,255,255), LV_COLOR_MAKE(0,0,0)};
  const char* color_names[] = {"R", "G", "B", "W", "K"};
  
  for(int i=0; i<5; i++) {
    lv_obj_t *box = lv_obj_create(scr);
    lv_obj_set_size(box, 30, 20);
    lv_obj_set_style_bg_color(box, test_colors[i], 0);
    lv_obj_set_style_border_width(box, 1, 0);
    lv_obj_set_style_border_color(box, lv_palette_main(LV_PALETTE_GREY), 0);
    lv_obj_align(box, LV_ALIGN_BOTTOM_LEFT, 10 + (i * 35), -10);
    
    lv_obj_t *lbl = lv_label_create(box);
    lv_label_set_text(lbl, color_names[i]);
    lv_obj_center(lbl);
    lv_obj_add_flag(lbl, LV_OBJ_FLAG_HIDDEN); // 숨김
    if(i == 3) lv_obj_set_style_text_color(lbl, lv_color_black(), 0); // Black text for White box
    else lv_obj_set_style_text_color(lbl, lv_color_white(), 0);
  }

  /* Separator */
  static lv_point_t line_points[] = {{0, 0}, {LCD_HEIGHT, 0}}; // Landscape orientation
  lv_obj_t *line = lv_line_create(scr);
  lv_line_set_points(line, line_points, 2);
  lv_obj_set_style_line_color(line, lv_palette_main(LV_PALETTE_GREY), 0);
  lv_obj_set_style_line_width(line, 2, 0);
  lv_obj_align(line, LV_ALIGN_TOP_MID, 0, 35);

  /* Ethernet Label */
  ui_label_eth = lv_label_create(scr);
  lv_label_set_recolor(ui_label_eth, true);
  lv_obj_set_style_text_color(ui_label_eth, lv_color_white(), 0);
  lv_obj_align(ui_label_eth, LV_ALIGN_TOP_LEFT, 10, 50);
  lv_obj_add_flag(ui_label_eth, LV_OBJ_FLAG_HIDDEN); // 이더넷 라벨 렌더링 무효화 (Hide)

  /* Access Point Label */
  ui_label_ap = lv_label_create(scr);
  lv_label_set_recolor(ui_label_ap, true);
  lv_obj_set_style_text_color(ui_label_ap, lv_color_white(), 0);
  lv_obj_align(ui_label_ap, LV_ALIGN_TOP_LEFT, 10, 80);
  lv_obj_add_flag(ui_label_ap, LV_OBJ_FLAG_HIDDEN); // 숨김

  /* Clients Info */
  ui_label_clients = lv_label_create(scr);
  lv_obj_set_style_text_color(ui_label_clients, lv_palette_lighten(LV_PALETTE_GREY, 1), 0);
  lv_obj_align(ui_label_clients, LV_ALIGN_TOP_LEFT, 10, 110);
  lv_obj_add_flag(ui_label_clients, LV_OBJ_FLAG_HIDDEN); // 숨김

  /* Animation Bar for FPS Verification */
  lv_obj_t *bar = lv_bar_create(scr);
  lv_obj_set_size(bar, 100, 5);
  lv_obj_align(bar, LV_ALIGN_BOTTOM_MID, 0, -40);
  lv_bar_set_range(bar, 0, 100);
  
