zenes/esp32s3-TAS/examples/tas/tas.ino
  Serial.println("\n[Note] WiFi AP is running.");
  Serial.println("       Internet access will be available after Ethernet connection.\n");

  // Step 5: Initialize LCD (Dynamically detected)
#ifdef ENABLE_LCD
  lcd_detected = detectLCD();
  if (lcd_detected) {
    Serial.print("Step 5: Initializing LCD Pins... ");
    pinMode(LCD_BL_PIN, OUTPUT);
    digitalWrite(LCD_BL_PIN, HIGH); // Turn on backlight
    Serial.println("Done.");

    /* Initialize LCD DMA */
    tft.init();

#ifdef ENABLE_TE_SYNC
    // ST7789 Frame Rate Control (FRCTRL2: 0xC6) 강제 조작
    // 스캐너 동작 주기를 하드웨어 기본값인 60Hz(약 16.6ms)로 설정
    tft.writecommand(0xC6);
    tft.writedata(0x0F); // 0x0F = 60Hz (기본값)
    Serial.println("ST7789 FRCTRL2 Overridden to 0x0F (60Hz) - TE Sync Enabled");

    // ST7789 TE(Tearing Effect) 핀 출력 활성화 (0x35)
    tft.writecommand(0x35);
    tft.writedata(0x00);
    Serial.println("ST7789 TE(Tearing Effect) Pin Output Enabled!");

    tft.initDMA(); // Start GDMA for SPI
    
    // Initialize TE Hardware Interrupt
    te_semaphore = xSemaphoreCreateBinary();
    pinMode(TE_PIN, INPUT_PULLDOWN);
    attachInterrupt(TE_PIN, te_isr_handler, RISING);
    Serial.println("Hardware TE Interrupt Attached to GPIO 21");
#else
    // Fast Mode: TE 미사용 및 패널 하드웨어 기본값(보통 60Hz) 그대로 작동하도록 방치
    Serial.println("ST7789 TE Sync Disabled (Fast Mode - Default Hardware Refresh Rate)");
    
    tft.initDMA(); // Start GDMA for SPI
#endif

    /* Initialize LVGL and Allocate DMA Buffers in Internal SRAM */
    lv_init();
    
    // Allocate 2 x 80KB buffers in Internal SRAM with DMA capability
    // 64 lines exactly matches the 32KB L1 Data Cache on ESP32-S3 (240x64x2 = 30.7KB)
    size_t lines = 64; 
    size_t buf_size = LCD_WIDTH * lines * sizeof(lv_color_t);
    
    buf1 = (lv_color_t *)heap_caps_malloc(buf_size, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    buf2 = (lv_color_t *)heap_caps_malloc(buf_size, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    
    if (buf1 == NULL || buf2 == NULL) {
        Serial.println("Failed to allocate DMA buffers! Falling back to SRAM Single...");
        if(buf1) free(buf1);
        static lv_color_t sram_single[LCD_WIDTH * 20];
        lv_disp_draw_buf_init(&draw_buf, sram_single, NULL, LCD_WIDTH * 20);
    } else {
        Serial.printf("DMA Double Buffers allocated: 2 x %u bytes\n", buf_size);
        lv_disp_draw_buf_init(&draw_buf, buf1, buf2, LCD_WIDTH * lines);
    }

    /* Initialize the display driver for LVGL */
    static lv_disp_drv_t disp_drv;
    lv_disp_drv_init(&disp_drv);
    disp_drv.hor_res = LCD_HEIGHT; // Landscape
    disp_drv.ver_res = LCD_WIDTH;  // Landscape
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.monitor_cb = my_monitor_cb; // 추가: 렌더링 성능 모니터링 연결
    disp_drv.draw_buf = &draw_buf; // CRITICAL: This was missing!
    
    // 강제 전체 업데이트 해제 (부분 업데이트로 복귀하여 프레임레이트 복구)
    disp_drv.full_refresh = 1; 

    lv_disp_t * disp_obj = lv_disp_drv_register(&disp_drv);
    
    /* Initialize and Register Touchpad */
#ifdef LCD_TYPE_ILI9341
    tp.begin();
    tp.setRotation(1); // Landscape for XPT2046
#elif defined(TOUCH_SDA) && defined(TOUCH_SCL)
    tp.begin();
    tp.setRotation(ROTATION_RIGHT);
#endif

    static lv_indev_drv_t indev_drv;
    lv_indev_drv_init(&indev_drv);
    indev_drv.type = LV_INDEV_TYPE_POINTER;
    indev_drv.read_cb = my_touchpad_read;
    lv_indev_drv_register(&indev_drv);

    /* Create a touch indicator on System Layer (Always on top) */
    touch_cursor = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_cursor, 10, 10);
    lv_obj_set_style_bg_color(touch_cursor, lv_palette_main(LV_PALETTE_RED), 0);
    lv_obj_set_style_radius(touch_cursor, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_border_width(touch_cursor, 0, 0);
    lv_obj_add_flag(touch_cursor, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_style_bg_opa(touch_cursor, LV_OPA_70, 0);

    // Horizontal crosshair
    touch_line_h = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_line_h, LCD_HEIGHT, 2); // Thicker (2px)
    lv_obj_set_style_bg_color(touch_line_h, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_add_flag(touch_line_h, LV_OBJ_FLAG_HIDDEN);

    // Vertical crosshair
    touch_line_v = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_line_v, 2, LCD_WIDTH); // Thicker (2px)
    lv_obj_set_style_bg_color(touch_line_v, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_add_flag(touch_line_v, LV_OBJ_FLAG_HIDDEN);

    // Coordinate label
    touch_label = lv_label_create(lv_layer_sys());
    lv_obj_set_style_text_color(touch_label, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_set_style_bg_color(touch_label, lv_palette_main(LV_PALETTE_GREY), 0);
    lv_obj_set_style_bg_opa(touch_label, LV_OPA_50, 0);
    lv_obj_add_flag(touch_label, LV_OBJ_FLAG_HIDDEN);

#ifdef ENABLE_TE_SYNC
    // Set refresh period to 16ms for 60 FPS (하드웨어 60Hz와 동기화)
    lv_timer_t * refr_timer = _lv_disp_get_refr_timer(disp_obj);
    if (refr_timer) lv_timer_set_period(refr_timer, 16);
#else
    // Set refresh period to 16ms for 60 FPS (최대 성능)
    lv_timer_t * refr_timer = _lv_disp_get_refr_timer(disp_obj);
    if (refr_timer) lv_timer_set_period(refr_timer, 16);
#endif

    lcd_initialized = true; 
    Serial.println("Done.");

    Serial.print("Step 7: LVGL UI creation... ");
    tft.setRotation(1); // Landscape
    initLVGLUI();
    updateLCD();
    Serial.println("Done.");
  } else {
    Serial.println("Step 5-7: LCD Hardware not found. Skipping.");
  }
#else
  Serial.println("Step 5-7: LCD Feature Disabled.");
#endif

  // Step 8: Initialize Ethernet
#ifdef ENABLE_ETHERNET
  logMsg(LOG_INFO, "Step 8: Initializing Ethernet...");

#if CONFIG_IDF_TARGET_ESP32
  ETH.begin(ETH_TYPE, ETH_ADDR, ETH_MDC_PIN, ETH_MDIO_PIN, ETH_RESET_PIN, ETH_CLK_MODE);
#else
  ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN,
            SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, 40);
#endif

#if USE_STATIC_IP
  ETH.config(local_ip, gateway, subnet, dns1, dns2);
#endif

